
// TD тип используемого распределения интенсивности поступления пакетов
// 1 - распределение Релея; 2 - распределение Вейбулла; 3 - Гамма распределение; 4 - распределение Пуассона
// LL=1e3; % Число пакетов в реализации
// AP=0.01; % Параметр распределения Релея и Вейбулла
// TP число разновидностей (типов) пакетов
// im_P вектор с вероятностями появления пакетов каждого типа
// I1=50e4; % Число реализаций обрабатываемых последовательсностей
// Tin_d предельная длительность появления  заявок на обслуживание, в сек

// [Map_s, Map] = SQ(I1,LL,im_P,TP,AP,TD,Tin_d);

